build-essential
clang
clang-format
clang-tidy
clangd
cmake
curl
doxygen
dpkg-dev
fzf
g++
g++-16
gdb
git
gitk
gnat
gnome
gnome-session
gparted
graphviz
gtkwave
hx
imagemagick
iwyu
lcov
libboost-all-dev
libc++-dev
libstdc++-16-dev
libzstd-dev
llvm
llvm-dev
make
meld
meson
meson
ninja-build
octave
octave-control
octave-signal
plocate
python-is-python3
python3-venv
qtbase5-dev
screen
silversearcher-ag
sqlite3
systemd-coredump
tcl
tcl-dev
tcpdump
tig
tmux
tree
tshark
universal-ctags
vim
wireshark
xournal
zlib1g-dev
zoxide
