build-essential
clang
clang-format
cmake
curl
doxygen
dpkg-dev
fzf
g++
gdb
git
gitk
gnome
gnome-session
gparted
libboost-dev-all
make
meld
meson
octave
octave-control
octave-signal
plocate
python-is-python3
python3-venv
qtbase5-dev
screen
silversearcher-ag
sqlite3
tcl
tcl-dev
tcpdump
tig
tmux
tree
tshark
universal-ctags
vim
wireshark
xournal
zoxide
